app/controllers/api/v1/offers_controller.rb

  def index
    @offers = Offer.all
---
SELECT "offers".* FROM "offers" WHERE (expiration >= '2014-02-25 18:30:45')